Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ2048EFH064.atdf
         <register caption="" name="LATG" offset="0x530" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATG0"/>
            <bitfield mask="0x00000002" name="LATG1"/>
            <bitfield mask="0x00000004" name="LATG2"/>
            <bitfield mask="0x00000008" name="LATG3"/>
            <bitfield mask="0x00000010" name="LATG4"/>
            <bitfield mask="0x00000020" name="LATG5"/>
            <bitfield mask="0x00000040" name="LATG6"/>
            <bitfield mask="0x00000080" name="LATG7"/>
            <bitfield mask="0x00000100" name="LATG8"/>
            <bitfield mask="0x00000200" name="LATG9"/>
            <bitfield mask="0x00000400" name="LATG10"/>
            <bitfield mask="0x00000800" name="LATG11"/>
            <bitfield mask="0x00001000" name="LATG12"/>
            <bitfield mask="0x00002000" name="LATG13"/>
            <bitfield mask="0x00004000" name="LATG14"/>
            <bitfield mask="0x00008000" name="LATG15"/>
         </register>
         <register caption="" name="ODCB" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCB0"/>
            <bitfield mask="0x00000002" name="ODCB1"/>
            <bitfield mask="0x00000004" name="ODCB2"/>
            <bitfield mask="0x00000008" name="ODCB3"/>
            <bitfield mask="0x00000010" name="ODCB4"/>
            <bitfield mask="0x00000020" name="ODCB5"/>
            <bitfield mask="0x00000040" name="ODCB6"/>
            <bitfield mask="0x00000080" name="ODCB7"/>
            <bitfield mask="0x00000100" name="ODCB8"/>
            <bitfield mask="0x00000200" name="ODCB9"/>
            <bitfield mask="0x00000400" name="ODCB10"/>
            <bitfield mask="0x00000800" name="ODCB11"/>
            <bitfield mask="0x00001000" name="ODCB12"/>
            <bitfield mask="0x00002000" name="ODCB13"/>
            <bitfield mask="0x00004000" name="ODCB14"/>
            <bitfield mask="0x00008000" name="ODCB15"/>
         </register>
         <register caption="" name="ODCC" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCC0"/>
            <bitfield mask="0x00000002" name="ODCC1"/>
            <bitfield mask="0x00000004" name="ODCC2"/>
            <bitfield mask="0x00000008" name="ODCC3"/>
            <bitfield mask="0x00000010" name="ODCC4"/>
            <bitfield mask="0x00000020" name="ODCC5"/>
            <bitfield mask="0x00000040" name="ODCC6"/>
            <bitfield mask="0x00000080" name="ODCC7"/>
            <bitfield mask="0x00000100" name="ODCC8"/>
            <bitfield mask="0x00000200" name="ODCC9"/>
            <bitfield mask="0x00000400" name="ODCC10"/>
            <bitfield mask="0x00000800" name="ODCC11"/>
            <bitfield mask="0x00001000" name="ODCC12"/>
            <bitfield mask="0x00002000" name="ODCC13"/>
            <bitfield mask="0x00004000" name="ODCC14"/>
            <bitfield mask="0x00008000" name="ODCC15"/>
         </register>
         <register caption="" name="ODCD" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCD0"/>
            <bitfield mask="0x00000002" name="ODCD1"/>
            <bitfield mask="0x00000004" name="ODCD2"/>
            <bitfield mask="0x00000008" name="ODCD3"/>
            <bitfield mask="0x00000010" name="ODCD4"/>
            <bitfield mask="0x00000020" name="ODCD5"/>
            <bitfield mask="0x00000040" name="ODCD6"/>
            <bitfield mask="0x00000080" name="ODCD7"/>
            <bitfield mask="0x00000100" name="ODCD8"/>
            <bitfield mask="0x00000200" name="ODCD9"/>
            <bitfield mask="0x00000400" name="ODCD10"/>
            <bitfield mask="0x00000800" name="ODCD11"/>
            <bitfield mask="0x00001000" name="ODCD12"/>
            <bitfield mask="0x00002000" name="ODCD13"/>
            <bitfield mask="0x00004000" name="ODCD14"/>
            <bitfield mask="0x00008000" name="ODCD15"/>
         </register>
         <register caption="" name="ODCE" offset="0x340" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCE0"/>
            <bitfield mask="0x00000002" name="ODCE1"/>
            <bitfield mask="0x00000004" name="ODCE2"/>
            <bitfield mask="0x00000008" name="ODCE3"/>
            <bitfield mask="0x00000010" name="ODCE4"/>
            <bitfield mask="0x00000020" name="ODCE5"/>
            <bitfield mask="0x00000040" name="ODCE6"/>
            <bitfield mask="0x00000080" name="ODCE7"/>
            <bitfield mask="0x00000100" name="ODCE8"/>
            <bitfield mask="0x00000200" name="ODCE9"/>
            <bitfield mask="0x00000400" name="ODCE10"/>
            <bitfield mask="0x00000800" name="ODCE11"/>
            <bitfield mask="0x00001000" name="ODCE12"/>
            <bitfield mask="0x00002000" name="ODCE13"/>
            <bitfield mask="0x00004000" name="ODCE14"/>
            <bitfield mask="0x00008000" name="ODCE15"/>
         </register>
         <register caption="" name="ODCF" offset="0x440" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCF0"/>
            <bitfield mask="0x00000002" name="ODCF1"/>
            <bitfield mask="0x00000004" name="ODCF2"/>
            <bitfield mask="0x00000008" name="ODCF3"/>
            <bitfield mask="0x00000010" name="ODCF4"/>
            <bitfield mask="0x00000020" name="ODCF5"/>
            <bitfield mask="0x00000040" name="ODCF6"/>
            <bitfield mask="0x00000080" name="ODCF7"/>
            <bitfield mask="0x00000100" name="ODCF8"/>
            <bitfield mask="0x00000200" name="ODCF9"/>
            <bitfield mask="0x00000400" name="ODCF10"/>
            <bitfield mask="0x00000800" name="ODCF11"/>
            <bitfield mask="0x00001000" name="ODCF12"/>
            <bitfield mask="0x00002000" name="ODCF13"/>
            <bitfield mask="0x00004000" name="ODCF14"/>
            <bitfield mask="0x00008000" name="ODCF15"/>
         </register>
         <register caption="" name="ODCG" offset="0x540" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCG0"/>
            <bitfield mask="0x00000002" name="ODCG1"/>
            <bitfield mask="0x00000004" name="ODCG2"/>
            <bitfield mask="0x00000008" name="ODCG3"/>
            <bitfield mask="0x00000010" name="ODCG4"/>
            <bitfield mask="0x00000020" name="ODCG5"/>
            <bitfield mask="0x00000040" name="ODCG6"/>
            <bitfield mask="0x00000080" name="ODCG7"/>
            <bitfield mask="0x00000100" name="ODCG8"/>
            <bitfield mask="0x00000200" name="ODCG9"/>
            <bitfield mask="0x00000400" name="ODCG10"/>
            <bitfield mask="0x00000800" name="ODCG11"/>
            <bitfield mask="0x00001000" name="ODCG12"/>
            <bitfield mask="0x00002000" name="ODCG13"/>
            <bitfield mask="0x00004000" name="ODCG14"/>
            <bitfield mask="0x00008000" name="ODCG15"/>
         </register>
