Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ2048EFH064.atdf
      <value-group caption="Group 3 Write Permissions bits" name="SBT1WR2__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT1WR3__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT1WR3__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 2 Write Permissions bits" name="SBT1WR3__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 3 Write Permissions bits" name="SBT1WR3__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT1WR4__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT1WR4__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 2 Write Permissions bits" name="SBT1WR4__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 3 Write Permissions bits" name="SBT1WR4__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT1WR5__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT1WR5__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 2 Write Permissions bits" name="SBT1WR5__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 3 Write Permissions bits" name="SBT1WR5__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT1WR6__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT1WR6__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 2 Write Permissions bits" name="SBT1WR6__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 3 Write Permissions bits" name="SBT1WR6__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT1WR7__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT1WR7__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 2 Write Permissions bits" name="SBT1WR7__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 3 Write Permissions bits" name="SBT1WR7__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT1WR8__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT1WR8__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0"/>
      </value-group>
